Repository: Mr-Second/QNote
Catalog: src/QNote/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# TrayShowItem.Text
source: Show window
zh_hans: 显示窗口

# TrayQuitItem.Text
source: Quit
zh_hans: 退出

# TrayShow
source: Show window
zh_hans: 显示窗口

# TrayQuit
source: Quit
zh_hans: 退出

# NotesSubtitle.Text
source: Sticky notes
zh_hans: 便签整理

# CategoryRename.Text
source: Rename
zh_hans: 重命名

# CategoryDelete.Text
source: Delete
zh_hans: 删除

# NewCategory.Text
source: New category
zh_hans: 新建分类

# NewCategoryButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New category
zh_hans: 新建分类

# NewCategoryButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: New category
zh_hans: 新建分类

# Settings.Text
source: Settings
zh_hans: 设置

# SettingsButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Settings
zh_hans: 设置

# SettingsButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Settings
zh_hans: 设置

# NotesSummary.Text
source: Note summaries
zh_hans: 便签摘要

# NewNoteButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New note
zh_hans: 新建便签

# NewNoteButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: New note
zh_hans: 新建便签

# SearchNotes.PlaceholderText
source: Search notes
zh_hans: 搜索便签

# SearchNotes.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Search notes
zh_hans: 搜索便签

# SearchSortButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Search sort
zh_hans: 搜索排序

# SearchSortButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Sort search results
zh_hans: 搜索结果排序

# SortByRelevance.Text
source: By relevance
zh_hans: 按匹配度

# SortByNewest.Text
source: Newest first
zh_hans: 最新优先

# SortByOldest.Text
source: Oldest first
zh_hans: 最早优先

# NotesEmpty.Text
source: No notes
zh_hans: 暂无便签

# ItemDelete.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Delete note
zh_hans: 删除便签

# ItemDelete.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete note
zh_hans: 删除便签

# EditorEmpty.Text
source: Select or create a note
zh_hans: 选择或创建一个便签

# TitleBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Note title
zh_hans: 便签标题

# TitleBox.PlaceholderText
source: Untitled note
zh_hans: 无标题便签

# NoteContent.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Note content
zh_hans: 便签内容

# ContentPlaceholder.Text
source: Type your note here...
zh_hans: 在这里输入便签内容...

# DirtyBadge.Text
source: ● Unsaved
zh_hans: ● 未保存

# CharCount.Text
source: 0 chars
zh_hans: 0 字

# SettingsDisplaySection.Text
source: Display
zh_hans: 显示

# SettingsDensityLabel.Text
source: List density
zh_hans: 列表密度

# SettingsDensityBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: List density
zh_hans: 列表密度

# DensityCompact.Content
source: Compact
zh_hans: 紧凑

# DensityStandard.Content
source: Standard
zh_hans: 标准

# DensityComfortable.Content
source: Comfortable
zh_hans: 宽松

# SettingsTimeFormatLabel.Text
source: Time format
zh_hans: 时间格式

source: Time format
zh_hans: 时间格式

# TimeFormatRelative.Content
source: Relative (3 min ago)
zh_hans: 相对（3 分钟前）

# TimeFormatTiered.Content
source: Tiered (time for today)
zh_hans: 分级（今日时分）

# TimeFormatFull.Content
source: Full (yyyy-MM-dd HH:mm)
zh_hans: 完整（年-月-日 时分）

# SettingsSortLabel.Text
source: Sort order
zh_hans: 便签排序

# SettingsSortBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Sort order
zh_hans: 便签排序

# SortUpdated.Content
source: Last updated
zh_hans: 更新时间

# SortCreated.Content
source: Date created
zh_hans: 创建时间

# SortTitle.Content
source: Title
zh_hans: 标题

# SettingsConfirmDeleteLabel.Text
source: Confirm before delete
zh_hans: 删除前确认

source: Confirm before delete
zh_hans: 删除前确认

# SettingsGeneralSection.Text
source: General
zh_hans: 常规

# SettingsThemeLabel.Text
source: Theme
zh_hans: 主题

# SettingsThemeBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Theme
zh_hans: 主题

# ThemeSystem.Content
source: Follow system
zh_hans: 跟随系统

# ThemeLight.Content
source: Light
zh_hans: 浅色

# ThemeDark.Content
source: Dark
zh_hans: 深色

# SettingsLanguageLabel.Text
source: Language
zh_hans: 语言

source: Language
zh_hans: 语言

# LangSystem.Content
source: Follow system
zh_hans: 跟随系统

# SettingsAutoSaveLabel.Text
source: Auto-save
zh_hans: 自动保存

source: Auto-save
zh_hans: 自动保存

# AutoSaveOff.Content
source: Off
zh_hans: 关闭

# AutoSave500Ms.Content
source: 500 ms
zh_hans: 500 毫秒

# AutoSave1S.Content
source: 1 s
zh_hans: 1 秒

# AutoSave2S.Content
source: 2 s
zh_hans: 2 秒

# AutoSave5S.Content
source: 5 s
zh_hans: 5 秒

# AutoSave10S.Content
source: 10 s
zh_hans: 10 秒

# AutoSave30S.Content
source: 30 s
zh_hans: 30 秒

# SettingsTopmostLabel.Text
source: Keep window on top
zh_hans: 窗口置顶

source: Keep window on top
zh_hans: 窗口置顶

# SettingsEdgeHideLabel.Text
source: Auto-hide at screen edge
zh_hans: 贴边自动隐藏

source: Auto-hide at screen edge
zh_hans: 贴边自动隐藏

# SettingsEdgeHideTaskbarLabel.Text
source: Hide taskbar icon while edge-hidden
zh_hans: 贴边隐藏时隐藏任务栏图标

source: Hide taskbar icon while edge-hidden
zh_hans: 贴边隐藏时隐藏任务栏图标

# SettingsHotkeyLabel.Text
source: Hide/show hotkey
zh_hans: 隐藏/显示快捷键

source: Hide/show hotkey
zh_hans: 隐藏/显示快捷键

# SettingsHotkeyButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Click, then press the new shortcut; Esc cancels, Backspace clears
zh_hans: 点击后按下新快捷键；Esc 取消，Backspace 清空

# SettingsGeometryLabel.Text
source: Remember window position and size
zh_hans: 记住窗口位置和大小

source: Remember window position and size
zh_hans: 记住窗口位置和大小

# SettingsStartMinimizedLabel.Text
source: Start minimized to tray
zh_hans: 启动时最小化到托盘

source: Start minimized to tray
zh_hans: 启动时最小化到托盘

# SettingsLaunchAtStartupLabel.Text
source: Launch at startup
zh_hans: 开机自启动

source: Launch at startup
zh_hans: 开机自启动

# SettingsUpdateCheckLabel.Text
source: Software update
zh_hans: 软件更新

source: Check for updates
zh_hans: 检查更新

# SettingsDataSection.Text
source: Data
zh_hans: 数据

# SettingsBackupRestoreLabel.Text
source: Backup & restore (.qns file)
zh_hans: 备份与恢复（.qns 文件）

source: Back up data
zh_hans: 备份数据

# SettingsBackupButton.Content
source: Back up…
zh_hans: 备份…

source: Restore data
zh_hans: 恢复数据

# SettingsRestoreButton.Content
source: Restore…
zh_hans: 恢复…

# BackupDialog.Title
source: Back up data
zh_hans: 备份数据

# BackupDialog.PrimaryButtonText
source: Start backup
zh_hans: 开始备份

# BackupDialog.CloseButtonText
source: Cancel
zh_hans: 取消

# BackupDescription.Text
source: Includes all notes, categories, settings and original images, saved as a single .qns file (ZIP, optional AES-256 encryption).
zh_hans: 包含全部便签、分类、设置和原始图片。备份为单个 .qns 文件（ZIP，可选 AES-256 加密）。

# BackupLocationLabel.Text
source: Save location
zh_hans: 保存位置

# BackupPathBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Backup save location
zh_hans: 备份保存位置

# BackupBrowseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Browse backup save location
zh_hans: 浏览备份保存位置

# BackupBrowseButton.Content
source: Browse…
zh_hans: 浏览…

# BackupPasswordBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Backup password
zh_hans: 备份密码

# BackupPasswordBox.Header
source: Password (optional — leave empty for no encryption)
zh_hans: 密码（可选，留空则不加密）

# BackupConfirmBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Confirm backup password
zh_hans: 确认备份密码

# BackupConfirmBox.Header
source: Confirm password
zh_hans: 确认密码

# RestoreDialog.Title
source: Restore data
zh_hans: 恢复数据

# RestoreDialog.PrimaryButtonText
source: Start restore
zh_hans: 开始恢复

# RestoreDialog.CloseButtonText
source: Cancel
zh_hans: 取消

# RestoreFileLabel.Text
source: Backup file
zh_hans: 备份文件

# RestoreFilePath.Text
source: No file selected
zh_hans: 未选择文件

# RestorePickButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Choose backup file
zh_hans: 选择备份文件

# RestorePickButton.Content
source: Browse…
zh_hans: 选择…

# AutoBackupsLabel.Text
source: Restore from an auto backup (created automatically before overwrite restore)
zh_hans: 从自动备份恢复（覆盖恢复前自动创建）

# AutoBackupsList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Auto-backup list
zh_hans: 自动备份列表

# RestorePasswordBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Backup password
zh_hans: 备份密码

# RestorePasswordBox.Header
source: Backup password (this backup is encrypted)
zh_hans: 备份密码（该备份已加密）

source: Analyze backup
zh_hans: 分析备份

# RestoreAnalyzeButton.Content
source: Analyze backup
zh_hans: 分析备份

# RestoreModeRadios.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Restore mode
zh_hans: 恢复模式

# RestoreModeOverwrite.Content
source: Overwrite: fully replace current data (an automatic backup of current data is made first)
zh_hans: 覆盖：完全替换当前数据（会先自动备份当前数据）

# RestoreModeMerge.Content
source: Merge: keep the newer version of conflicting notes, and import new notes
zh_hans: 合并：冲突便签保留较新版本，并导入新便签

# RestoreModeImportNew.Content
source: Import new only: import just notes that don't exist here
zh_hans: 仅导入新增：只导入当前不存在的便签

# OverwriteWarning.Text
source: Overwriting deletes all your current notes, categories and settings, replacing them with the backup content.
zh_hans: 覆盖将删除当前全部便签、分类和设置，替换为备份内容。

# CategoryEditDialog.PrimaryButtonText
source: Save
zh_hans: 保存

# CategoryEditDialog.CloseButtonText
source: Cancel
zh_hans: 取消

# CategoryNameBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Category name
zh_hans: 分类名称

# CategoryNameBox.Header
source: Name
zh_hans: 名称

# CategoryNameBox.PlaceholderText
source: Category name
zh_hans: 分类名称

# CategoryColorLabel.Text
source: Color
zh_hans: 颜色

# SwatchBlue.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Blue
zh_hans: 蓝色

# SwatchGreen.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Green
zh_hans: 绿色

# SwatchRed.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Red
zh_hans: 红色

# SwatchAmber.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Amber
zh_hans: 琥珀色

# CustomColorBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Custom color
zh_hans: 自定义颜色

# CategoryIconLabel.Text
source: Icon
zh_hans: 图标

# CategoryGlyphGrid.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Category icon
zh_hans: 分类图标

# ToastCloseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Close notification
zh_hans: 关闭提示

# ToastCloseButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Close
zh_hans: 关闭

# DeleteButton
source: Delete
zh_hans: 删除

# CancelButton
source: Cancel
zh_hans: 取消

# CloseButton
source: Close
zh_hans: 关闭

# GotItButton
source: Got it
zh_hans: 知道了

# GoDownloadButton
source: Go to download
zh_hans: 前往下载

# LaterButton
source: Later
zh_hans: 稍后再说

# CharsFormat
source: {0} chars
zh_hans: {0} 字

# EditedAtFormat
source: Edited {0}
zh_hans: 编辑于 {0}

# DeleteNoteTitle
source: Delete note
zh_hans: 删除便签

# DeleteNoteContent
source: Delete this note? This cannot be undone.
zh_hans: 确认删除这条便签?此操作无法撤销。

# NewCategoryTitle
source: New category
zh_hans: 新建分类

# EditCategoryTitle
source: Edit category
zh_hans: 编辑分类

# DeleteCategoryTitle
source: Delete category
zh_hans: 删除分类

# DeleteCategoryWithNotesContent
source: This will delete the category "{0}" and its {1} notes. This cannot be undone.
zh_hans: 将删除分类「{0}」及其中的 {1} 条便签，此操作无法撤销。

# DeleteCategoryContent
source: Delete the category "{0}"? This cannot be undone.
zh_hans: 确认删除分类「{0}」？此操作无法撤销。

# SettingsTitle
source: Settings
zh_hans: 设置

# UpdateAvailableTitle
source: New version available
zh_hans: 发现新版本

# UpdateAvailableContent
source: Version {0} is out — download it from GitHub.
zh_hans: 最新版本 {0} 已发布，可前往 GitHub 下载。

# CheckUpdateTitle
source: Check for updates
zh_hans: 检查更新

# UpToDateContent
source: You're up to date.
zh_hans: 当前已是最新版本。

# CheckUpdateFailedContent
source: Couldn't check for updates. Check your network connection and try again.
zh_hans: 检查更新失败，请检查网络连接后重试。

# ImageErrorTitle
source: Image
zh_hans: 图片

# CategoryAll
source: All
zh_hans: 全部

# CategoryWorkName
source: Work
zh_hans: 工作

# CategoryLifeName
source: Life
zh_hans: 生活

# CategoryImportantName
source: Important
zh_hans: 重要

# NotesCountFormat
source: Notes: {0}
zh_hans: 共 {0} 条

# NotesEmptyText
source: No notes
zh_hans: 暂无便签

# UntitledNote
source: New note
zh_hans: 新便签

# CreateCategoryFailed
source: Couldn't create the category — see the log for details.
zh_hans: 新建分类失败，请查看日志

# UpdateCategoryFailed
source: Couldn't update the category — see the log for details.
zh_hans: 更新分类失败，请查看日志

# DeleteCategoryFailed
source: Couldn't delete the category — see the log for details.
zh_hans: 删除分类失败，请查看日志

# CategoryErrorNameBlank
source: Enter a category name.
zh_hans: 请输入分类名称

# CategoryErrorNameDuplicate
source: A category named "{0}" already exists.
zh_hans: 分类「{0}」已存在

# CategoryErrorNotFound
source: That category no longer exists.
zh_hans: 分类不存在

# CategoryErrorBuiltInRename
source: The built-in category "{0}" can't be renamed.
zh_hans: 内置分类「{0}」不能重命名

# CategoryErrorBuiltInDelete
source: The built-in category "{0}" can't be deleted.
zh_hans: 内置分类「{0}」不能删除

# CategoryErrorInvalidColor
source: Color must be in #RRGGBB format.
zh_hans: 颜色必须是 #RRGGBB 格式

# CategoryEditColorInvalidHint
source: Color must be in #RRGGBB format (e.g. #3B82F6)
zh_hans: 颜色必须是 #RRGGBB 格式（如 #3B82F6）

# CategoryEditIconRequired
source: Pick an icon.
zh_hans: 请选择一个图标

# BackupFileTypeLabel
source: QNote backup
zh_hans: QNote 备份

# BackupCannotStart
source: Can't start the backup
zh_hans: 无法开始备份

# BackupNoPath
source: Choose a save location first.
zh_hans: 请选择备份保存位置。

# BackupPasswordMismatch
source: The two passwords don't match.
zh_hans: 两次输入的密码不一致。

# BackupSuccessTitle
source: Backup complete
zh_hans: 备份成功

# BackupSuccessPathFormat
source: Backup saved to: {0}
zh_hans: 备份文件已保存到：{0}

# BackupFailedTitle
source: Backup failed
zh_hans: 备份失败

# RestoreCannotReadTitle
source: Can't read the backup
zh_hans: 无法读取备份

# RestoreAnalyzeFailedTitle
source: Analysis failed
zh_hans: 分析失败

# RestoreAnalysisFormat
source: The backup contains {0} notes{1}: {2} conflict with your notes, {3} exist only in the backup, {4} exist only here.
zh_hans: 备份包含 {0} 条便签{1}：与当前冲突 {2} 条，仅备份中存在 {3} 条，仅当前存在 {4} 条。

# RestoreAnalysisCreatedFormat
source: (created {0})
zh_hans: （创建于 {0}）

# RestoreSuccessTitle
source: Restore complete
zh_hans: 恢复成功

# RestoreSuccessMessage
source: The backup has been restored.
zh_hans: 备份数据已恢复。

# RestoreFailedTitle
source: Restore failed
zh_hans: 恢复失败

# BackupErrorArchiveNotFound
source: The backup file doesn't exist.
zh_hans: 备份文件不存在。

# BackupErrorNotAnArchive
source: This file can't be read: it isn't a valid QNote backup.
zh_hans: 无法读取该文件：不是有效的备份。

# BackupErrorPasswordRequired
source: This backup is encrypted — enter its password.
zh_hans: 该备份已加密，请输入密码。

# BackupErrorWrongPassword
source: Wrong password, or the backup file is damaged.
zh_hans: 密码错误，或备份文件已损坏。

# BackupErrorMissingDatabase
source: The backup is missing qnote.db.
zh_hans: 备份中缺少 qnote.db。

# BackupErrorCorruptArchive
source: The backup file is damaged and can't be unpacked.
zh_hans: 备份文件已损坏，无法解包。

# BackupErrorNewerVersion
source: This backup was made by a newer version of QNote (database schema v{0}; this build supports v{1}). Upgrade the app, then restore again.
zh_hans: 备份由更新版本的 QNote 创建（数据库结构 v{0}，当前支持 v{1}），请升级应用后再恢复。

# BackupErrorTooOld
source: The backup's database schema (v{0}) is too old to merge. Use overwrite restore instead.
zh_hans: 备份的数据库结构过旧（v{0}），无法逐条合并；请改用覆盖恢复。

# BackupErrorUnsupportedVersion
source: This backup version isn't supported.
zh_hans: 备份版本不受支持。

# BackupErrorUnexpected
source: The operation failed — see the log for details.
zh_hans: 操作失败，请查看日志。

# HotkeyCaptureHint
source: Press the shortcut…
zh_hans: 按下快捷键…

# HotkeyNotSet
source: Not set
zh_hans: 未设置

# HotkeyRegisterFailed
source: Couldn't register the hotkey — it may be taken by another app. Try a different key.
zh_hans: 热键注册失败：可能已被其他程序占用，请更换按键

# HotkeyNeedsModifier
source: Hold Win / Ctrl / Alt / Shift, or use a function key (F1–F12)
zh_hans: 请同时按住 Win / Ctrl / Alt / Shift，或使用 F1–F12 功能键

# StartupEnabledByPolicy
source: Enabled by system policy
zh_hans: 已由系统策略启用

# StartupDisabledByUser
source: Disabled in Windows — re-enable it in Task Manager → Startup apps
zh_hans: 已被系统禁用，请在任务管理器→启动应用 中重新启用

# StartupDisabledByPolicy
source: Disabled by system policy
zh_hans: 已被系统策略禁用

# StartupUnavailable
source: Launch at startup isn't supported in this environment
zh_hans: 当前环境不支持开机自启动

# CheckUpdateButton
source: Check for updates…
zh_hans: 检查更新…

# CheckingUpdateButton
source: Checking…
zh_hans: 检查中…

# PortableFallbackTitle
source: Data location notice
zh_hans: 数据目录提示

# PortableFallbackContent
source: The app's folder isn't writable, so the portable data folder can't be used. Your notes will be stored in: {0}
zh_hans: 程序所在目录不可写，无法使用便携数据目录。 便签数据将保存在： {0}

# ImageUnsupportedFormat
source: Unsupported image format: {0}
zh_hans: 不支持的图片格式：{0}

# ImageInsertFailed
source: Couldn't insert the image — see the log for details.
zh_hans: 插入图片失败，请查看日志

# ImageServiceUnavailable
source: The image service isn't available — can't insert the image.
zh_hans: 图片服务不可用，无法插入图片

# ImageDecodeFailed
source: That image can't be decoded (the format may be unsupported).
zh_hans: 无法解码该图片（可能是不支持的格式）

# ImageSaveFailed
source: Couldn't save the image — see the log for details.
zh_hans: 保存图片失败，查看日志

# SettingsAboutSection.Text
source: About
zh_hans: 关于

# AboutTagline.Text
source: Lightweight Windows sticky notes · fully local data
zh_hans: 轻量 Windows 便签 · 数据纯本地

# AboutGitHubLink.Content
source: GitHub repository (source · Releases · Issues)
zh_hans: GitHub 仓库（源码 · Releases · Issues）

# AboutGitHubLink.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: GitHub repository (source · Releases · Issues)
zh_hans: GitHub 仓库（源码 · Releases · Issues）

# AboutStoreLink.Content
source: Rate QNote on Microsoft Store
zh_hans: 在 Microsoft Store 评分

# AboutStoreLink.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Rate QNote on Microsoft Store
zh_hans: 在 Microsoft Store 评分

# AboutPrivacyLink.Content
source: Privacy policy (no accounts · no telemetry)
zh_hans: 隐私政策（无账号 · 无遥测）

# AboutPrivacyLink.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Privacy policy (no accounts · no telemetry)
zh_hans: 隐私政策（无账号 · 无遥测）

# AboutLicenseLink.Content
source: Open-source license & third-party notices
zh_hans: 开源许可与第三方致谢

# AboutLicenseLink.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Open-source license & third-party notices
zh_hans: 开源许可与第三方致谢

# AboutCommunity.Text
source: With thanks to the LINUX DO community
zh_hans: 感谢 LINUX DO 社区
